[
    {
        "courseCode": "CS-0040",
        "courseName": "Machine Structure & Assembly-language Programming",
        "description": "Structure of machine-level data and code, including memory, cache, registers, machine arithmetic, and bitwise operations. Encapsulating machine functionality through interfaces and abstract data types. Structure of assembly code, relocatable object code, and binary machine code, and the translations between them. Applications of machine-level operations and code translations in programming projects.\nHigh demand (see \"course notes\" for signup procedure).",
        "sections": [
            {
                "section": "01-LEC",
                "classNo": "22612",
                "classTime": "Tu, Th 1:30PM - 2:45PM",
                "location": "Robinson Wing TTC, Room 253",
                "session": "Regular",
                "faculty": "Mark A Sheldon, Noah Mendelsohn",
                "credits": "5",
                "status": ""
            }
        ]
    },
    {
        "courseCode": "CS-0171",
        "courseName": "Human Computer Interaction",
        "description": "Introduction to human-computer interaction, or how computers communicate with people. Methodology for designing and testing user interfaces, interaction styles (command line, menus, graphical user interfaces, virtual reality), interaction techniques (voice, gesture, eye movement), design guidelines, and user-interface management system software. Students will design a small user interface, program a prototype, and test the result for usability.\nRecommendations: CS 15 or junior/senior in CBS major",
        "sections": [
            {
                "section": "01-LEC",
                "classNo": "22721",
                "classTime": "Mo, We 1:30PM - 2:45PM",
                "location": "Joyce Cummings Center, 160",
                "session": "Regular",
                "faculty": "Robert Jacob",
                "credits": "3",
                "status": ""
            }
        ]
    },
    {
        "courseCode": "CS-0131",
        "courseName": "Artificial Intelligence",
        "description": "History, theory, and computational methods of artificial intelligence. Basic concepts include representation of knowledge and computational methods for reasoning. One or two application areas will be studied, to be selected from expert systems, robotics, computer vision, natural language understanding, and planning.",
        "sections": [
            {
                "section": "01-LEC",
                "classNo": "22632",
                "classTime": "Mo, We 6:00PM - 7:15PM",
                "location": "Joyce Cummings Center, 160",
                "session": "Regular",
                "faculty": "Fabrizio Santini",
                "credits": "3",
                "status": ""
            }
        ]
    },
    {
        "courseCode": "CS-0111",
        "courseName": "Operating Systems",
        "description": "(Cross-listed as EE 128). Fundamental issues in operating system design. Concurrent processes: synchronization, sharing, deadlock, scheduling. Relevant hardware properties of uniprocessor and multiprocessor computer systems.",
        "sections": [
            {
                "section": "01-LEC",
                "classNo": "22629",
                "classTime": "Tu, Th 4:30PM - 5:45PM",
                "location": "Joyce Cummings Center, 170",
                "session": "Regular",
                "faculty": "Dave Lillethun",
                "credits": "3",
                "status": ""
            }
        ]
    },
    {
        "courseCode": "CS-0138",
        "courseName": "Reinforcement Learning",
        "description": "Agents that learn, plan, and act in complex, uncertain environments. Varying topics that may include practical successes and challenges of reinforcement learning; common software libraries and packages used to implement and test reinforcement learning algorithms, and advanced topics such as transfer learning and deep reinforcement learning. Recommendations: CS 131 and/or CS 135. Proficiency in one of C++, Java, or Python.",
        "sections": [
            {
                "section": "01-LEC",
                "classNo": "23474",
                "classTime": "Mo, We 3:00PM - 4:15PM",
                "location": "Joyce Cummings Center, 160",
                "session": "Regular",
                "faculty": "Jivko Sinapov",
                "credits": "3",
                "status": ""
            }
        ]
    },
    {
        "courseCode": "CS-0135",
        "courseName": "Introduction To Machine Learning And Data Mining",
        "description": "An overview of methods whereby computers can learn from data or experience and make decisions accordingly. Topics include supervised learning, unsupervised learning, reinforcement learning, and knowledge extraction from large databases with applications to science, engineering, and medicine.\nRecommendations: CS 160 is highly recommended.",
        "sections": [
            {
                "section": "01-LEC",
                "classNo": "22633",
                "classTime": "Tu, Th 12:00PM - 1:15PM",
                "location": "Barnum Dana Complex, Room LL08",
                "session": "Regular",
                "faculty": "Michael C. Hughes",
                "credits": "3",
                "status": ""
            }
        ]
    },
    {
        "courseCode": "CS-0165",
        "courseName": "Probability",
        "description": "Probability, conditional probability, random variables and distributions, expectation, special distributions, joint distributions, laws of large numbers, and the central limit theorem.\nPrerequisite: MATH 34 or graduate standing.",
        "sections": [
            {
                "section": "01-LEC",
                "classNo": "21775",
                "classTime": "Tu, Th 3:00PM - 4:15PM",
                "location": "Joyce Cummings Center, 260",
                "session": "Regular",
                "faculty": "David Smyth",
                "credits": "4",
                "status": ""
            }
        ]
    },
    {
        "courseCode": "EE-0024",
        "courseName": "Probabilistic Systems Analysis",
        "description": "Development of analytical tools for the modeling and analysis of random phenomena with application to problems across a range of engineering and applied science disciplines. Probability theory, sample and event spaces, discrete and continuous random variables, conditional probability, expectations and conditional expectations, and derived distributions. Sums of random variables, moment generating functions, central limit theorem, laws of large numbers. Statistical analysis methods including hypothesis testing, confidence intervals and nonparametric methods. Undergraduates may not take both EE 0024 and EE 0104 for degree credit.\nPrerequisite: Math 0042 or equivalent",
        "sections": [
            {
                "section": "01-LEC",
                "classNo": "22516",
                "classTime": "Tu, Th 10:30AM - 11:45AM",
                "location": "Anderson Wing TTC, Room 211",
                "session": "Regular",
                "faculty": "Mai Vu",
                "credits": "3",
                "status": ""
            }
        ]
    }
]